app/Http/Controllers/OrderController.php

select * from `regions` where `status` = 'active'
---
    public function index()
    {
        $orders = Order::with(['user', 'region'])
            ->when(request('status'), function ($query) {
                return $query->where('status', request('status'));
            })
            ->latest()
            ->paginate(10);